
# parameters
nc: 8  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov4s backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, InvertedResidual, [32]],

   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
   [-1, 1, InvertedResidual, [64]],

   [-1, 1, Conv, [256, 3, 2]],  # 5-P3/8
   [-1, 1, InvertedResidual, [128]],

   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16
   [-1, 1, InvertedResidual, [256]],

  ]

# yolov4s head
# na = len(anchors[0])
head:
  [[-1, 1, SPPCSP, [256]], # 9
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [-1, 1, Separable_Conv, [128, 3, 1]], # 12

   [-2, 1, Conv, [128, 1, 1]], # 13
   [[-1, -6], 1, Concat, [1]],  # cat
   [-1, 1, Separable_Conv, [128, 3, 1]], # 15

   [-2, 1, Conv, [128, 1, 1]], # 16
   [[-1, -2], 1, Concat, [1]],  # cat

   [-1, 1, Separable_Conv, [1024, 3, 1]], # 18


   [[12, 15, 18], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]