# parameters
nc: 8  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov4s backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0
   [-1, 1, Conv, [64, 3, 2]],  # 1-P1/2
   [-1, 1, InvertedResidual, [32]],

   [-1, 1, Conv, [128, 3, 2]],  # 3-P2/4
   [-1, 1, InvertedResidual, [64]],

   [-1, 1, Conv, [256, 3, 2]],  # 5-P3/8
   [-1, 1, InvertedResidual, [128]],

   [-1, 1, Conv, [512, 3, 2]],  # 7-P4/16
   [-1, 1, InvertedResidual, [256]],

  ]

# yolov4s head
# na = len(anchors[0])
head:
  [[-1, 1, SPPCSP, [256]], # 9
   [-1, 1, Conv, [128, 1, 1]],  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 11
   [6, 1, Conv, [128, 1, 1]], # route backbone P4 (12)
   [[-1, -2], 1, Concat, [1]], #13
   [-1, 1, InvertedResidual, [128]], # 14
   [-1, 1, Conv, [128, 3, 1]], # 15

   [-2, 1, Conv, [128, 3, 2]],  # 16
   [[-1, -7], 1, Concat, [1]],  # cat  (17)
   [-1, 1, InvertedResidual, [128]], # 18
   [-1, 1, Conv, [128, 3, 1]],  # 19

   [-2, 1, Conv, [128, 3, 2]],  # 20
   [-12, 1, Conv, [128, 3, 2]],  # 21
   [[-1, -2], 1, Concat, [1]],  # cat (22)
   [-1, 1, InvertedResidual, [128]], # 23
   [-1, 1, Conv, [1024, 3, 1]],  # 24

   [[15,19,24], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]